load-tests/export-excel.yml
# Artillery load test — POST /api/export (Excel)
#
# Heavy operation: queries Supabase and renders an Excel workbook.
#
# Run with:  npx artillery run load-tests/export-excel.yml
#
# Goals:
#   • 20 concurrent virtual users sustained
#   • p95 response time < 10 000 ms (10 s)
#   • zero 5xx errors

config:
  target: "{{ $processEnvironment.TARGET || 'http://localhost:3000' }}"
  phases:
    - name: warmup
      duration: 15
      arrivalRate: 2
    - name: ramp-to-20-vus
      duration: 30
      arrivalRate: 5
      rampTo: 20
    - name: sustained-20-vus
      duration: 60
      arrivalRate: 20
  defaults:
    headers:
      x-api-key:    "{{ $processEnvironment.API_INTERNAL_KEY || 'test-internal-key' }}"
      content-type: "application/json"
  ensure:
    thresholds:
      - http.response_time.p95: 10000
    conditions:
      - expression: http.codes.5xx == 0

scenarios:
  - name: generate excel (all invoices)
    flow:
      - post:
          url: "/api/export"
          json:
            type: "excel"
            async_job: false
          expect:
            - statusCode: 200

  - name: generate excel (inkoop only)
    flow:
      - post:
          url: "/api/export"
          json:
            type: "excel"
            async_job: false
            direction: "inkoop"
          expect:
            - statusCode: 200